[
    {
        "id": 1,
        "name": "Apple iPhone 13 Pro Max",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2021/10/Apple-iPhone-13-Pro-Max-image.jpg",
        "description": "Apple iPhone 13 Pro Max comes with a 6.7 inches Super Retina XDR OLED Full HD+ screen. It has an Apple iPhone notch design. The back camera is of quad 12+12+12 Megapixel + TOF 3D LiDAR scanner with powerful image processing capability and 4K video recording. The front one is of Dual 12 MP and SL 3D camera. Apple iPhone 13 Pro Max comes with 4352 mAh battery with 27W fast charging solution. It has 6 GB RAM, up to 3.22 GHz Hexa-core CPU and Apple GPU. It is powered by a 5 nm Apple A15 Bionic chipset. The device comes with 128, 256, 512 GB or 1 TB internal storage. Among other features, there is Face ID, Apple Pay, Siri, Qi Wireless Charging etc. There is no FM Radio, 3.5mm jack and MicroSD slot in this phone. The device is IP68 certified waterproof and 5G supported.",
        "supplier": "Apple",
        "quantity":220,
        "price": 1399
        
    },
    {
        "id": 2,
        "name": "Apple iPhone 8",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2019/03/Apple-iPhone-8-Black.jpg",
        "description": "Apple iPhone 8 is coming with a front and back glass design for the first time in an iPhone. Now you won’t feel any cheap plastic or cold metal while holding your iPhone in hand. Rather, you will feel elegant and smooth glass. Another fine improvement is its camera. Both front and back camera quality has been improved and they are arguably the best smartphone cameras of 2016. Better sensor, new color filter, and deeper pixels are some of the new adding in its camera. The True Tone technology ensures a brilliant viewing experience. The while balance of your display will adjust automatically to the environment around you to give you a clear and comfortable experience. Not to mention that the color accuracy is also tremendous in iPhone 8.",
        "supplier": "Apple",
        "quantity":155,
        "price": 799
        
    },
    {
        "id": 3,
        "name": "Apple iPhone 11",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2019/09/Apple-iPhone-11.jpg",
        "description": "Apple iPhone 11 comes with 6.1 inches Liquid Retina IPS LCD screen. It has a classical Apple iPhone notch design. The back camera is of Dual 12+12 MP with powerful image processing capability and Ultra HD 4K video recording. The front camera is of Dual 12 MP and SL 3D camera. Apple iPhone 11 comes with 3110 mAh battery with 18W fast charging solution. It has 4 GB RAM, up to 2.65 GHz hexa-core CPU and Apple GPU. It is powered by Apple A13 Bionic (7 nm+) chipset. The device comes with 64, 128 or 256 GB internal storage. There is no fingerprint sensor in this device.",
        "supplier": "Apple",
        "quantity":63,
        "price": 1099
        
    },
    {
        "id": 4,
        "name": "Apple iPhone 6S Plus",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2019/03/Apple-iPhone-6S-Plus-Gold.jpeg",
        "description": "Apple iPhone 6S Plus has all the qualities and features of iPhone 6S. Because of the bigger size of the display and higher resolution, it is called 6S “Plus.” In this smart gadget, Apple used a 5.5 inch Full HD retina display in iPhone 6S plus. As display consumes the most of the battery, the battery capacity is also higher than 6S. Additionally, both front and back camera has optical image stabilization that stabilizes the picture in case if the hand shakes a little in the last moment of a beautiful capture.",
        "supplier": "Apple",
        "quantity":4,
        "price": 699
        
    },
    {
        "id": 5,
        "name": "Samsung Galaxy A23",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2022/04/Samsung-Galaxy-A23.jpg",
        "description": "Samsung Galaxy A23 comes with 6.6 inches Full HD+ PLS TFT screen. It has a waterdrop notch front camera design. The back camera is of Quad 50+5+2+2 with PDAF, OIS, f/1.8 aperture, ultrawide, depth sensor, dedicated macro camera etc. and 4K video recording. The front camera is of 8 MP. Galaxy A23 comes with 5000 mAh battery with 25W fast charging. It has 6 GB RAM, up to 2.4 GHz octa-core CPU and Adreno 610 GPU. It is powered by a Qualcomm Snapdragon 680 4G (6 nm) chipset. The device comes with 128 GB internal storage and dedicated MicroSD slot. There is a side-mounted fingerprint sensor in this phone.",
        "supplier": "Samsung",
        "quantity":300,
        "price": 400
        
    },
    {
        "id": 6,
        "name": "Samsung Galaxy A73 5G",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2022/04/Samsung-Galaxy-A73-5G.jpg",
        "description": "Samsung Galaxy A73 5G comes with 6.7 inches Full HD+ Super AMOLED Plus screen. It has a center punch-hole front camera design. The back camera is of Quad 108+12+5+5 with PDAF, OIS, ultrawide, depth sensor, dedicated macro camera etc. and Ultra HD video recording. The front camera is of 32 MP. Galaxy A73 5G comes with 5000 mAh battery with 25W fast charging. It has 6 or 8 GB RAM, up to 2.4 GHz octa-core CPU and Adreno 642L GPU. It is powered by a Qualcomm Snapdragon 778G 5G (6 nm) chipset. The device comes with 128 or 256 GB internal storage and shared MicroSD slot. There is an in-display optical fingerprint sensor in this phone.",
        "supplier": "Samsung",
        "quantity": 200,
        "price": 899
        
    },
    {
        "id": 7,
        "name": "Samsung Galaxy S22 Ultra",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-Ultra-image.jpg",
        "description": "Samsung Galaxy S22 Ultra comes with 6.8 inches Quad HD+ Dynamic AMOLED 2X screen. It has a punch-hole front camera design. The back camera is of quad 108+10+10+12 MP with Laser AF, OIS, periscope telephoto, 10x optical zoom, ultrawide etc. and 8K video recording. The front camera is of 40 Megapixel. Galaxy S22 Ultra comes with 5000 mAh battery with 45W fast charging. It has 12 GB RAM, up to 3.0 GHz octa-core CPU and Adreno 730 GPU. It is powered by a Qualcomm Snapdragon 8 Gen 1 (4 nm) chipset. The device comes with 256 GB UFS 3.1 internal storage and no MicroSD slot. There is an ultrasonic in-display fingerprint sensor in this phone.",
        "supplier": "Samsung",
        "quantity": 90,
        "price": 1850
        
    },
    {
        "id": 8,
        "name": "Samsung Galaxy Z Fold3 5G",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2021/09/Samsung-Galaxy-Z-Fold3-5G-image.jpg",
        "description": "Samsung Galaxy Z Fold3 5G comes with 7.6 inches (unfolded) Full HD+ high-quality Dynamic AMOLED 2X screen. It has a foldable smartphone design. The back camera is of triple 12+12+12 MP with 4K video recording option. The front camera is of 4 MP with an extra 10 MP cover display camera. Galaxy Z Fold3 5G comes with 4400 mAh battery. It has 12 GB RAM, up to 2.84 GHz octa-core CPU and Adreno 660 GPU. It is powered by a Qualcomm Snapdragon 888 5G (5 nm) chipset. The device comes with 256 or 512 GB internal storage and no MicroSD slot. There is a side-mounted fingerprint sensor in this phone.",
        "supplier": "Samsung",
        "quantity": 25,
        "price": 2100
        
    },
    {
        "id": 9,
        "name": "Xiaomi 12 Pro",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2022/04/Xiaomi-12-Pro.jpg",
        "description": "Xiaomi 12 Pro comes with 6.73 inches Quad HD+ LTPO AMOLED screen. It has a Full-View center punch-hole design. The frontside is protected by a Gorilla Glass Victus. The back camera is of triple 50+50+50 MP with dual-Pixel PDAF, dual-LED flash, 115º ultrawide lens, telephoto camera, OIS, 2x optical zoom, 1/1.28″, 1.22µm, etc. and up to 8K video recording. The front camera is of 32 MP. Xiaomi 12 Pro comes with 4600 mAh battery with 120W Quick Charge 4+ fast charging and 50W Fast Wireless Charging options. It has 8 or 12 GB RAM, up to 3 GHz octa-core CPU and Adreno 730 GPU. It is powered by a Qualcomm Snapdragon 8 Gen 1 (4 nm) chipset. The device comes in 128 or 256 GB UFS 3.1 internal storage and no Memory Card slot. There is an optical in-display fingerprint sensor in this phone.",
        "supplier": "Xiaomi",
        "quantity":89,
        "price": 1159
        
    },
    {
        "id": 10,
        "name": "Xiaomi 11i Hypercharge 5G",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2022/04/Xiaomi-11i-Hypercharge-5G.jpg",
        "description": "Xiaomi 11i Hypercharge 5G comes with 6.67 inches Full HD+ AMOLED screen. It has a Full-View center punch-hole design. The frontside is protected by a 5th generation Gorilla Glass. The back camera is of triple 108+8+2 MP with PDAF, LED flash, ultrawide, macro camera, etc. and 4K video recording. The front camera is of 16 MP. Xiaomi 11i Hypercharge comes with 4500 mAh battery with 120W hyper charging. It has 6 or 8 GB RAM, up to 2.5 GHz octa-core CPU and Mali-G68 MC4 GPU. It is powered by a MediaTek Dimensity 920 5G (6 nm) chipset. The device comes with 128 or 256 GB UFS 2.2 internal storage and shared Memory Card slot. There is a side-mounted fingerprint sensor in this phone.",
        "supplier": "Xiaomi",
        "quantity":92,
        "price": 589
        
    },
    {
        "id": 11,
        "name": "Xiaomi 11T Pro",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2021/12/Xiaomi-11T-Pro-image.jpg",
        "description": "Xiaomi 11T Pro comes with 6.67 inches Full HD+ AMOLED screen. It has a Full-View center punch-hole design. The frontside is protected by a Gorilla Glass Victus. The back camera is of triple 108+8+5 MP with PDAF, dual-LED flash, ultrawide, telephoto macro camera, etc. and 4K video recording. The front camera is of 16 MP. 11T Pro comes with 5000 mAh battery with 120W Quick Charge 3+ fast charging. It has 8 GB RAM, up to 2.84GHz octa-core CPU and Adreno 660 GPU. It is powered by a Qualcomm Snapdragon 888 5G (5 nm) chipset. The device comes in 128 or 256 GB UFS 3.1 internal storage and no Memory Card slot. There is a side-mounted fingerprint sensor in this phone.",
        "supplier": "Xiaomi",
        "quantity":96,
        "price": 899
        
    },
    {
        "id": 12,
        "name": "Xiaomi Mi 11X 5G",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2021/05/Xiaomi-Mi-11X-image.jpg",
        "description": "Xiaomi Mi 11X 5G comes with 6.67 inches Full HD+ Super AMOLED screen. It has a Full-View punch-hole design. Both front and backside are protected by 5th generation Gorilla Glasses. The back camera is of triple 48+8+5 MP with PDAF, LED flash, ultrawide, dedicated macro camera, etc. and 4K video recording. The front camera is of 20 MP. Mi 11X comes with 4520 mAh battery with 33W fast charging. It has 6 or 8 GB RAM, up to 3.2 GHz octa-core CPU and Adreno 650 GPU. It is powered by a Qualcomm Snapdragon 870 5G (7 nm) chipset. The device comes in 128 GB UFS 3.1 internal storage and no external Memory Card slot. There is aside-mounted fingerprint sensor in this phone.",
        "supplier": "Xiaomi",
        "quantity":44,
        "price": 699
        
    },
    {
        "id": 13,
        "name": "Vivo X70 Pro 5G",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2021/10/Vivo-X70-Pro-5G-image.jpg",
        "description": "Vivo X70 Pro 5G comes with 6.56 inches Full HD+ AMOLED screen. It has a middle punch-hole front camera design. The back camera is of Quad 50+8+12+12 MP with PDAF, gimbal OIS, up to 5x optical zoom, periscope telephoto, ultrawide, Zeiss T* lens coating, Pixel Shift, dual-LED Flash etc. and 4K Ultra HD video recording. The front camera is of 32 MP. Vivo X70 Pro 5G comes with 4450 mAh battery with 44W fast charging. It has 12 GB RAM, up to 3.0 GHz octa-core CPU and Mali-G77 MC9 GPU. It is powered by a MediaTek Dimensity 1200 5G (6 nm) chipset. The device comes with 256 GB internal storage and no MicroSD slot. There is an in-display (optical) fingerprint sensor in this phone.",
        "supplier": "Vivo",
        "quantity": 100,
        "price": 899
        
    },
    {
        "id": 14,
        "name": "Vivo V23 5G",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2022/01/Vivo-V23-5G-image.jpg",
        "description": "Vivo V23 5G comes with 6.44 inches Full HD+ AMOLED screen. It has a medium notch front camera design. The back camera is of triple 64+8+2 MP with PDAF, ultrawide, OIS, macro lens, LED flash etc. and 4K video recording. The front camera is of dual 50+8 MP. Vivo V23 5G comes with 4200 mAh battery with 44W Fast Charging. It has 8 GB RAM, up to 2.5 GHz octa-core CPU and Mali-G68 MC4 GPU. It is powered by a MediaTek Dimensity 920 5G (6 nm) chipset. The device comes with 128 GB internal storage and no MicroSD slot. There is an in-display (optical) fingerprint sensor in this phone.",
        "supplier": "Vivo",
        "quantity": 66,
        "price": 399
        
    },
    {
        "id": 15,
        "name": "Vivo V19",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2020/04/Vivo-V19-Bangladesh-new.jpg",
        "description": "Vivo V19 comes with 6.44 inches Full HD+ Super AMOLED screen. It has a double punch-hole front camera design. The back camera is of quad 48+8+2+2 MP with PDAF, ultrawide, depth sensor, dedicated macro camera etc. and Ultra HD video recording. The front camera is of dual 32+8 MP. Vivo V19 comes with 4500 mAh battery with 33W fast charging. It has 8 GB RAM, up to 2.3 GHz octa-core CPU and Adreno 616 GPU. It is powered by a Qualcomm Snapdragon 712 (10 nm) chipset. The device comes with 128 or 256 GB internal storage and dedicated MicroSD slot. There is an in-display (optical) fingerprint sensor in this phone.",
        "supplier": "Vivo",
        "quantity": 134,
        "price": 340
        
    },
    {
        "id": 16,
        "name": "Vivo V15 Pro",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2019/03/Vivo-V15-Pro-Blue.jpg",
        "description": "Vivo V15 Pro is a high-mid range smartphone. The main feature of this phone is a 32-megapixel pop-up front camera and a no notch max full-view display. The phone comes with a huge 6.39-inch fully bezel-less screen. It is one of the main specialties of this smartphone. Watching videos, reading, using apps or internet browsing should be very comfortable with the big screen and without any notch on top. The display quality is super AMOLED Full HD+ with 400 PPI. Super AMOLED is also known for its crisp view and considered as the best display technology in the current market. We couldn’t find any information about Gorilla Glass screen protection. The back side is made of plastic with gradient colors and kind of glass-like finish on the top of it. It is a very premium thing to look at. It can be a nice gift or a good choice for long-term premium users who have a taste for design.",
        "supplier": "Vivo",
        "quantity": 56,
        "price": 399
        
    },
    {
        "id": 17,
        "name": "Oppo Reno 10x Zoom",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2019/06/Oppo-Reno-10x-Zoom.jpg",
        "description": "Those who want an ultimate flagship experience with maximum performance, next-level futuristic, elegant design, highly admirable display, top-notch camera quality and super fast battery charging, Oppo Reno 10x Zoom is one of the finest choices in 2019. It is more of an upgraded version of Oppo Reno with better back camera quality and performance. There are few other excellent flagship choices in the current market. So, why choose this one? First of all, the design with the so-called “shark fin pop-up front camera” is something that clearly stands out in the crowd. The triple back camera quality is also something very impressive with 10x telephoto zoom and powerful night mode. Oppo already made a name for excellent quality smartphone cameras. Then comes the 20W VOOC Flash Charge. It is also Oppo’s own fast charging technology and one of the fastest in the current market. 6.6″ huge Full HD+ super AMOLED max-vision screen is another great point for considering this phone. Industry-leading 7 nm Snapdragon 855 performance with further gaming optimization is also one of its key factors.",
        "supplier": "Oppo",
        "quantity": 87,
        "price": 899
        
    },
    {
        "id": 18,
        "name": "Oppo R17 Pro",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2020/04/Oppo-R17-Pro-new.jpg",
        "description": "Oppo R17 Pro is a high-mid range smartphone priced 69,990 Tk. in Bangladesh upon its release. After analyzing its specs, we concluded that the closest competitor of it in Bangladesh would be OnePlus 6T (62,990 Tk.) and Xiaomi Mi Mix 2S (58,490 Tk.). So, the pricing is quite a drawback of this device. Oppo R17 Pro comes with 3700 mAh battery with impressive SuperVOOC Flash charge. It may charge 40% in just 10 minutes and 100% in just about 35 minutes. The battery shall last about a day with one full charge for through users. The display is a vivid Full HD+ one which is well-readable under the sunlight. Color contrast is pretty good too. Design wise, the 6.4” water drop notch design with 91.5% screen ratio, 6th gen. Gorilla Glass, 3D misted gradient glass back and aluminum frame leaves a stunning impression.",
        "supplier": "Oppo",
        "quantity": 86,
        "price": 820
        
    },
    {
        "id": 19,
        "name": "Oppo Reno",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2019/06/Oppo-Reno-back-green.jpg",
        "description": "One can probably say that, if you give Oppo Reno 10 out of 10 points just because of its design, it will still be a fair review. We are honest to say that its design primarily influences our rating of this phone. Of course, we carefully considered the other specs as well, to make sure that it doesn’t have any flaws, especially looking at the price tag. The so-called “Shark Fin” pop-up front camera is one of the main attractions of this device. It is called this way because it looks like a shark fin above the water when popped up. The overall craftsmanship, especially the look of the back side, is exquisite and impressively artistic. The material is some premium hard polycarbonate which seems much more durable and classy than a regular glass back. The fine gradient color contrast with glossy finish resembles beauty and good taste. For us, it is one of the best smartphone designs we have seen in smartphone history. The 6.4 inches max vision AMOLED display with Full HD+ resolution and a 6th generation Gorilla Glass protection will further support our statement. If the design is your first preference, there is no competitor of it at the time of its release in mid-2019.",
        "supplier": "Oppo",
        "quantity": 77,
        "price": 629
        
    },
    {
        "id": 20,
        "name": "Oppo Reno3 Pro",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2020/06/Oppo-Reno3-Pro-Blue-new.jpg",
        "description": "Oppo Reno3 Pro comes with 6.4 inches Full HD+ Super AMOLED screen. It has a double punch-hole front camera design. The back camera is of Quad 64+13+8+2 MP with 2x optical zoom, ultrawide, telephoto, depth sensor, PDAF, dual-LED flash etc. features and Ultra HD video recording option. The front camera is of Dual 44+2 MP. Oppo Reno3 Pro comes with 4025 mAh battery with 30W VOOC 4.0 fast charging. It has 8 GB RAM, up to 2.2 GHz octa-core CPU and PowerVR GM9446 GPU. It is powered by a Mediatek Helio P95 (12 nm) chipset. The device comes with 128 or 256 GB internal storage and dedicated MicroSD slot. There is an in-display optical fingerprint sensor in this phone.",
        "supplier": "Oppo",
        "quantity": 94,
        "price": 550
        
    },
    {
        "id": 21,
        "name": "OnePlus 10 Pro 5G",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2022/04/OnePlus-10-Pro.jpg",
        "description": "OnePlus 10 Pro 5G comes with 6.7 inches QHD+ LTPO2 Fluid AMOLED screen. It has a left punch-hole front camera design. The back camera is of triple 48+8+50 MP with multi-directional PDAF, Laser autofocus, optical image stabilization, f/1.7 aperture, dual-LED flash, 150º ultrawide, telephoto, 3.3x optical zoom, Hasselblad Color Calibration etc. and 8K video recording. The front camera is of 32 Megapixel. OnePlus 10 Pro 5G comes with 5000 mAh battery with 80W fast charging and 50W fast wireless charging. It has 12 GB RAM, up to 3.0 GHz octa-core CPU and Adreno 730 GPU. It is powered by a Qualcomm Snapdragon 8 Gen 1 (4 nm) chipset. The device comes with 256 GB internal storage and no MicroSD slot. There is an optical in-display fingerprint sensor in this phone.",
        "supplier": "OnePlus",
        "quantity": 90,
        "price": 1100
        
    },
    {
        "id": 22,
        "name": "OnePlus 7T Pro",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2019/10/OnePlus-7T-Pro-blue.jpg",
        "description": "OnePlus 7T Pro comes with 6.55 inches 1440 x 3120 pixels Fluid AMOLED screen. It has a Max-view pop-up front camera design. The back camera is of triple 48+8+16 MP with PDAF, OIS, 2x optical zoom, telephoto, dual-LED flash etc. and Ultra HD video recording, EIS. The front camera is of 16 Megapixel with motorized pop-up mechanism. OnePlus 7T Pro comes with 4085 mAh battery with 30W fast charging. It has 8 GB RAM (12 GB RAM in the McLaren Edition), up to 2.96 GHz octa-core CPU and Adreno 640 GPU. It is powered by Qualcomm Snapdragon 855+ (7 nm) chipset. The device comes with 128 or 256 GB internal storage and no MicroSD slot. There is an optical in-display fingerprint sensor in this phone.",
        "supplier": "OnePlus",
        "quantity": 67,
        "price": 800
        
    },
    {
        "id": 23,
        "name": "OnePlus 7T",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2020/04/OnePlus-7T-silver.jpg",
        "description": "OnePlus 7T comes with 6.55 inches Full HD+ Fluid AMOLED screen. It has a Full-View waterdrop notch design. The back camera is of triple 48+12+16 MP with PDAF, OIS, 2x optical zoom, telephoto, dual-LED flash etc. and Ultra HD video recording, EIS. The front camera is of 16 Megapixel. OnePlus 7T comes with 3800 mAh battery with 30W fast charging. It has 8 GB RAM, up to 2.96 GHz octa-core CPU and Adreno 640 GPU. It is powered by Qualcomm Snapdragon 855+ (7 nm) chipset. The device comes with 128 or 256 GB internal storage and no MicroSD slot. There is an optical in-display fingerprint sensor in this phone.",
        "supplier": "OnePlus",
        "quantity": 90,
        "price": 700
        
    },
    {
        "id": 24,
        "name": "OnePlus 7 Pro",
        "image": "https://www.mobiledokan.com/wp-content/uploads/2019/05/OnePlus-7-Pro.jpg",
        "description": "OnePlus phones are recognized for superior performance. OnePlus 7 Pro goes beyond and comes with a 12 GB RAM version to provide smoothest graphics performance. Although, 6 GB RAM version should work well with most users. The liquid cooling technology prevents the phone from heating up even after long sessions.",
        "supplier": "OnePlus",
        "quantity": 56,
        "price": 1000
        
    }
    

]